[
    {
        "bookId": 1,
        "bookName": "Social Engineering: The Art of Human Hacking",
        "author": "Christopher Hadnagy",
        "image": "https://m.media-amazon.com/images/I/71pXnVZWo5L._AC_UF1000,1000_QL80_.jpg",
        "review": "A comprehensive guide to the ins and outs of social engineering. This book provides an in-depth look at the techniques and tactics used by social engineers to manipulate human behavior and gain unauthorized access to systems and information. It covers a wide range of topics, including psychological principles, case studies, and practical advice for defending against social engineering attacks. Whether you're a security professional or simply interested in understanding the human element of hacking, this book offers valuable insights and knowledge.",
        "totalPages": 416,
        "rating": 4.7,
        "category": "Social Engineering",
        "tags": [
            "Security",
            "Psychology"
        ],
        "publisher": "Wiley",
        "yearOfPublishing": 2010
    },
    {
        "bookId": 2,
        "bookName": "The Art of Deception",
        "author": "Kevin D. Mitnick",
        "image": "https://m.media-amazon.com/images/I/61tMgZNyA4L._AC_UF1000,1000_QL80_.jpg",
        "review": "Explores the human side of security and how to defend against social engineering attacks. In this book, Mitnick, a former hacker turned security consultant, shares his expertise on the tactics used by social engineers to deceive and manipulate individuals. Through real-world examples and personal anecdotes, he illustrates the vulnerabilities in human psychology that can be exploited and provides practical strategies for preventing social engineering attacks. This book is an essential read for anyone looking to understand and protect against the art of deception.",
        "totalPages": 368,
        "rating": 4.5,
        "category": "Social Engineering",
        "tags": [
            "Security",
            "Psychology"
        ],
        "publisher": "Wiley",
        "yearOfPublishing": 2002
    },
    {
        "bookId": 3,
        "bookName": "Unmasking the Social Engineer",
        "author": "Christopher Hadnagy",
        "image": "https://m.media-amazon.com/images/I/71WOmYe9riL._AC_UF1000,1000_QL80_.jpg",
        "review": "Examines the psychological principles behind social engineering. This book delves into the mind of the social engineer, exploring the psychological tactics and techniques used to manipulate individuals and gain unauthorized access to information. Hadnagy combines scientific research with real-world case studies to provide a comprehensive understanding of social engineering. He also offers practical advice for recognizing and defending against these manipulative tactics. This book is a valuable resource for security professionals and anyone interested in the psychology of hacking.",
        "totalPages": 256,
        "rating": 4.3,
        "category": "Social Engineering",
        "tags": [
            "Security",
            "Psychology"
        ],
        "publisher": "Wiley",
        "yearOfPublishing": 2014
    },
    {
        "bookId": 4,
        "bookName": "Ghost in the Wires",
        "author": "Kevin Mitnick",
        "image": "https://m.media-amazon.com/images/I/71V5rXhglvL._AC_UF1000,1000_QL80_.jpg",
        "review": "An autobiographical account of one of the most infamous hackers. In this gripping memoir, Mitnick recounts his adventures as a hacker and his life on the run from the authorities. He details his exploits in social engineering and hacking, revealing the methods he used to infiltrate systems and evade capture. The book provides a fascinating insight into the mind of a hacker and the world of cybercrime. It's a thrilling read that offers both entertainment and a deeper understanding of the vulnerabilities in our digital world.",
        "totalPages": 432,
        "rating": 4.6,
        "category": "Social Engineering",
        "tags": [
            "Security",
            "Biography"
        ],
        "publisher": "Little, Brown and Company",
        "yearOfPublishing": 2011
    },
    {
        "bookId": 5,
        "bookName": "Clean Code",
        "author": "Robert C. Martin",
        "image": "https://m.media-amazon.com/images/I/51E2055ZGUL._AC_UF1000,1000_QL80_.jpg",
        "review": "A handbook of agile software craftsmanship. This book is a must-read for any software developer who wants to write cleaner, more maintainable code. Martin provides a comprehensive guide to writing code that is not only functional but also easy to read and understand. He covers a wide range of topics, from naming conventions and code structure to testing and refactoring. With practical examples and best practices, this book helps developers improve their coding skills and produce high-quality software. It's an essential resource for anyone striving for excellence in software development.",
        "totalPages": 464,
        "rating": 4.7,
        "category": "Programming",
        "tags": [
            "Software Development",
            "Best Practices"
        ],
        "publisher": "Prentice Hall",
        "yearOfPublishing": 2008
    },
    {
        "bookId": 6,
        "bookName": "The Pragmatic Programmer",
        "author": "Andrew Hunt",
        "image": "https://m.media-amazon.com/images/I/61ztlXgCmpL._AC_UF1000,1000_QL80_.jpg",
        "review": "A journey to mastery in software development. This book provides practical advice and tips for becoming a better programmer. Hunt and Thomas share their insights on a wide range of topics, including code design, debugging, testing, and project management. They emphasize the importance of pragmatic thinking and continuous learning in software development. With its practical approach and real-world examples, this book is a valuable resource for both novice and experienced developers. It's a guide to developing high-quality software and building a successful career in programming.",
        "totalPages": 352,
        "rating": 4.8,
        "category": "Programming",
        "tags": [
            "Software Development",
            "Best Practices"
        ],
        "publisher": "Addison-Wesley Professional",
        "yearOfPublishing": 1999
    },
    {
        "bookId": 7,
        "bookName": "Introduction to the Theory of Computation",
        "author": "Michael Sipser",
        "image": "https://m.media-amazon.com/images/I/61dPNb6AUJL._AC_UF1000,1000_QL80_.jpg",
        "review": "A comprehensive guide to theoretical computer science. This book provides a detailed introduction to the fundamental concepts of computer science theory. Sipser covers topics such as automata theory, computability theory, and complexity theory, providing clear explanations and mathematical rigor. The book includes numerous examples and exercises to help readers understand and apply the concepts. It's an essential resource for students and professionals in computer science who want to deepen their understanding of theoretical foundations.",
        "totalPages": 504,
        "rating": 4.5,
        "category": "Programming",
        "tags": [
            "Computer Science",
            "Theory"
        ],
        "publisher": "Cengage Learning",
        "yearOfPublishing": 1997
    },
    {
        "bookId": 8,
        "bookName": "Design Patterns: Elements of Reusable Object-Oriented Software",
        "author": "Erich Gamma",
        "image": "https://m.media-amazon.com/images/I/81gtKoapHFL._AC_UF1000,1000_QL80_.jpg",
        "review": "A catalog of simple and succinct solutions to commonly occurring design problems. This book is a classic in software engineering, offering a comprehensive guide to design patterns in object-oriented programming. Gamma and his co-authors provide detailed descriptions of 23 design patterns, including their applicability, implementation, and benefits. The book includes numerous examples and diagrams to illustrate the patterns and their use in real-world scenarios. It's an invaluable resource for software developers and architects looking to improve their design skills and create more flexible and maintainable code.",
        "totalPages": 395,
        "rating": 4.6,
        "category": "Programming",
        "tags": [
            "Software Development",
            "Design Patterns"
        ],
        "publisher": "Addison-Wesley Professional",
        "yearOfPublishing": 1994
    },
    {
        "bookId": 9,
        "bookName": "You Don't Know JS",
        "author": "Kyle Simpson",
        "image": "https://m.media-amazon.com/images/I/71mKvD89oEL._AC_UF1000,1000_QL80_.jpg",
        "review": "An in-depth exploration of the core mechanisms of the JavaScript language. This book series delves into the intricacies of JavaScript, covering topics such as scope, closures, objects, and asynchronous programming. Simpson provides clear explanations and practical examples to help readers understand the language's complexities and nuances. The books are suitable for both beginners and experienced developers who want to deepen their knowledge of JavaScript. They offer a thorough understanding of the language's core principles and best practices for writing efficient and maintainable code.",
        "totalPages": 278,
        "rating": 4.7,
        "category": "Programming",
        "tags": [
            "JavaScript",
            "Web Development"
        ],
        "publisher": "O'Reilly Media",
        "yearOfPublishing": 2014
    },
    {
        "bookId": 10,
        "bookName": "Effective Java",
        "author": "Joshua Bloch",
        "image": "https://m.media-amazon.com/images/I/7167aaVxs3L._AC_UF1000,1000_QL80_.jpg",
        "review": "A guide to best practices in Java programming. This book offers a comprehensive collection of best practices for writing efficient, reliable, and maintainable Java code. Bloch covers a wide range of topics, including object creation, serialization, concurrency, and performance. Each chapter contains practical tips and examples to help developers avoid common pitfalls and improve their coding skills. The book is well-organized and easy to follow, making it a valuable resource for both novice and experienced Java programmers. It's a must-read for anyone looking to master the art of Java programming.",
        "totalPages": 416,
        "rating": 4.8,
        "category": "Programming",
        "tags": [
            "Java",
            "Software Development"
        ],
        "publisher": "Addison-Wesley Professional",
        "yearOfPublishing": 2001
    },
    {
        "bookId": 11,
        "bookName": "The C Programming Language",
        "author": "Brian W. Kernighan",
        "image": "https://m.media-amazon.com/images/I/51EyaJeebHL._AC_UF1000,1000_QL80_.jpg",
        "review": "The definitive guide to C programming. This classic book, often referred to as 'K&R', is considered the authoritative reference for C programming. Kernighan and Ritchie provide a concise and clear introduction to the C language, covering its syntax, semantics, and standard library. The book includes numerous examples and exercises to help readers understand and apply the concepts. It's an essential resource for anyone learning C programming or looking to deepen their understanding of the language. Its timeless content and practical approach make it a must-have for every programmer's library.",
        "totalPages": 272,
        "rating": 4.5,
        "category": "Programming",
        "tags": [
            "C Programming",
            "Software Development"
        ],
        "publisher": "Prentice Hall",
        "yearOfPublishing": 1978
    },
    {
        "bookId": 12,
        "bookName": "The Web Application Hacker's Handbook",
        "author": "Dafydd Stuttard",
        "image": "https://m.media-amazon.com/images/I/81a2pCFfm9L._AC_UF1000,1000_QL80_.jpg",
        "review": "A comprehensive guide to web application security testing. This book covers a wide range of topics related to web security, including common vulnerabilities, attack techniques, and defense strategies. Stuttard and Pinto provide detailed explanations and practical examples to help readers understand and test web application security. The book also includes information on the latest tools and technologies used in web security testing. It's an essential resource for security professionals, developers, and anyone interested in learning about web application security. With its thorough coverage and practical approach, this book is a valuable addition to any security library.",
        "totalPages": 912,
        "rating": 4.6,
        "category": "Hacking",
        "tags": [
            "Security",
            "Web Applications"
        ],
        "publisher": "Wiley",
        "yearOfPublishing": 2011
    },
    {
        "bookId": 13,
        "bookName": "Metasploit: The Penetration Tester's Guide",
        "author": "David Kennedy",
        "image": "https://m.media-amazon.com/images/I/81w9ymMApUL._AC_UF1000,1000_QL80_.jpg",
        "review": "A guide to the Metasploit Framework for penetration testing. This book provides a detailed introduction to Metasploit, one of the most popular tools for penetration testing and security research. Kennedy and his co-authors cover a wide range of topics, including installation, configuration, and usage of Metasploit for various types of security assessments. The book includes practical examples and step-by-step instructions to help readers get started with Metasploit and use it effectively in their security testing. It's an essential resource for penetration testers, security professionals, and anyone interested in learning about Metasploit and its capabilities.",
        "totalPages": 328,
        "rating": 4.7,
        "category": "Hacking",
        "tags": [
            "Security",
            "Penetration Testing"
        ],
        "publisher": "No Starch Press",
        "yearOfPublishing": 2011
    },
    {
        "bookId": 14,
        "bookName": "Hacking: The Art of Exploitation",
        "author": "Jon Erickson",
        "image": "https://m.media-amazon.com/images/I/91UlU666haL._AC_UF1000,1000_QL80_.jpg",
        "review": "An introduction to the fundamentals of hacking and security. This book provides a comprehensive guide to the techniques and concepts used by hackers to exploit vulnerabilities in systems and applications. Erickson covers a wide range of topics, including programming, shellcode, debugging, and reverse engineering. The book includes practical examples and hands-on exercises to help readers understand and apply the concepts. It's an essential resource for anyone interested in learning about hacking and security, whether you're a beginner or an experienced professional. With its thorough coverage and practical approach, this book is a valuable addition to any security library.",
        "totalPages": 488,
        "rating": 4.8,
        "category": "Hacking",
        "tags": [
            "Security",
            "Exploitation"
        ],
        "publisher": "No Starch Press",
        "yearOfPublishing": 2003
    },
    {
        "bookId": 15,
        "bookName": "Black Hat Python",
        "author": "Justin Seitz",
        "image": "https://m.media-amazon.com/images/I/91zU8vKrk+L._AC_UF1000,1000_QL80_.jpg",
        "review": "A guide to Python programming for hackers and pentesters. This book provides a detailed introduction to using Python for hacking and penetration testing. Seitz covers a wide range of topics, including network scanning, exploitation, and web application testing. The book includes practical examples and hands-on exercises to help readers understand and apply the concepts. It's an essential resource for security professionals, developers, and anyone interested in learning about Python and its applications in security. With its thorough coverage and practical approach, this book is a valuable addition to any security library.",
        "totalPages": 192,
        "rating": 4.6,
        "category": "Hacking",
        "tags": [
            "Python",
            "Security"
        ],
        "publisher": "No Starch Press",
        "yearOfPublishing": 2014
    },
    {
        "bookId": 16,
        "bookName": "The Hacker Playbook 2",
        "author": "Peter Kim",
        "image": "https://m.media-amazon.com/images/I/7127-2sCmZL._AC_UF1000,1000_QL80_.jpg",
        "review": "A practical guide to penetration testing. This book provides a step-by-step guide to performing penetration tests, covering a wide range of topics and techniques. Kim shares his expertise and insights on various aspects of penetration testing, including reconnaissance, exploitation, and post-exploitation. The book includes practical examples and hands-on exercises to help readers understand and apply the concepts. It's an essential resource for security professionals, developers, and anyone interested in learning about penetration testing. With its thorough coverage and practical approach, this book is a valuable addition to any security library.",
        "totalPages": 358,
        "rating": 4.7,
        "category": "Hacking",
        "tags": [
            "Security",
            "Penetration Testing"
        ],
        "publisher": "CreateSpace Independent Publishing Platform",
        "yearOfPublishing": 2015
    },
    {
        "bookId": 17,
        "bookName": "Practical Malware Analysis",
        "author": "Michael Sikorski",
        "image": "https://m.media-amazon.com/images/I/81wIATT3RRL._AC_UF1000,1000_QL80_.jpg",
        "review": "A guide to analyzing and understanding malware. This book provides a comprehensive introduction to malware analysis, covering a wide range of topics and techniques. Sikorski and Honig provide detailed explanations and practical examples to help readers understand and analyze malware. The book includes information on the latest tools and technologies used in malware analysis, as well as case studies and hands-on exercises. It's an essential resource for security professionals, developers, and anyone interested in learning about malware analysis. With its thorough coverage and practical approach, this book is a valuable addition to any security library.",
        "totalPages": 800,
        "rating": 4.8,
        "category": "Hacking",
        "tags": [
            "Security",
            "Malware"
        ],
        "publisher": "No Starch Press",
        "yearOfPublishing": 2012
    },
    {
        "bookId": 18,
        "bookName": "Gray Hat Hacking",
        "author": "Allen Harper",
        "image": "https://m.media-amazon.com/images/I/61LJmpiYaSL._AC_UF1000,1000_QL80_.jpg",
        "review": "The ethical hacker's handbook. This book provides a comprehensive guide to ethical hacking, covering a wide range of topics and techniques. Harper and his co-authors provide detailed explanations and practical examples to help readers understand and apply ethical hacking techniques. The book includes information on the latest tools and technologies used in ethical hacking, as well as case studies and hands-on exercises. It's an essential resource for security professionals, developers, and anyone interested in learning about ethical hacking. With its thorough coverage and practical approach, this book is a valuable addition to any security library.",
        "totalPages": 576,
        "rating": 4.6,
        "category": "Hacking",
        "tags": [
            "Security",
            "Ethical Hacking"
        ],
        "publisher": "McGraw-Hill Education",
        "yearOfPublishing": 2004
    },
    {
        "bookId": 19,
        "bookName": "Linux Basics for Hackers",
        "author": "OccupyTheWeb",
        "image": "https://cdn.dc5.ro/img-prod/255922247-0.jpeg",
        "review": "An introduction to the Linux operating system and command line for beginners. This book provides a comprehensive guide to the Linux operating system, covering a wide range of topics and techniques. OccupyTheWeb provides detailed explanations and practical examples to help readers understand and use Linux. The book includes information on the latest tools and technologies used in Linux, as well as hands-on exercises to help readers apply the concepts. It's an essential resource for security professionals, developers, and anyone interested in learning about Linux. With its thorough coverage and practical approach, this book is a valuable addition to any security library.",
        "totalPages": 248,
        "rating": 4.7,
        "category": "Linux",
        "tags": [
            "Security",
            "Linux"
        ],
        "publisher": "No Starch Press",
        "yearOfPublishing": 2018
    },
    {
        "bookId": 20,
        "bookName": "Networking for Hackers",
        "author": "Bryan Burns",
        "image": "https://m.media-amazon.com/images/I/61Rp8kZQLIL._AC_UF1000,1000_QL80_.jpg",
        "review": "A beginner's guide to networking concepts essential for hackers. This book provides a comprehensive introduction to networking concepts, covering a wide range of topics and techniques. Burns provides detailed explanations and practical examples to help readers understand and use networking in the context of hacking. The book includes information on the latest tools and technologies used in networking, as well as hands-on exercises to help readers apply the concepts. It's an essential resource for security professionals, developers, and anyone interested in learning about networking. With its thorough coverage and practical approach, this book is a valuable addition to any security library.",
        "totalPages": 312,
        "rating": 4.5,
        "category": "Networking",
        "tags": [
            "Security",
            "Networking"
        ],
        "publisher": "No Starch Press",
        "yearOfPublishing": 2020
    },
    {
        "bookId": 21,
        "bookName": "Mastering Linux Security and Hardening",
        "author": "Donald A. Tevault",
        "image": "https://m.media-amazon.com/images/I/71m0+dJ8m8L._AC_UF1000,1000_QL80_.jpg",
        "review": "Techniques and tools for securing a Linux system. This book provides a comprehensive guide to Linux security and hardening, covering a wide range of topics and techniques. Tevault provides detailed explanations and practical examples to help readers understand and apply Linux security concepts. The book includes information on the latest tools and technologies used in Linux security, as well as hands-on exercises to help readers apply the concepts. It's an essential resource for security professionals, developers, and anyone interested in learning about Linux security. With its thorough coverage and practical approach, this book is a valuable addition to any security library.",
        "totalPages": 504,
        "rating": 4.6,
        "category": "Linux",
        "tags": [
            "Security",
            "Linux"
        ],
        "publisher": "Packt Publishing",
        "yearOfPublishing": 2018
    },
    {
        "bookId": 22,
        "bookName": "The Linux Command Line",
        "author": "William E. Shotts Jr.",
        "image": "https://m.media-amazon.com/images/I/81tKmn7KX1L._AC_UF1000,1000_QL80_.jpg",
        "review": "A comprehensive introduction to the Linux command line. This book provides a detailed guide to using the Linux command line, covering a wide range of topics and techniques. Shotts provides detailed explanations and practical examples to help readers understand and use the command line effectively. The book includes information on the latest tools and technologies used in the Linux command line, as well as hands-on exercises to help readers apply the concepts. It's an essential resource for security professionals, developers, and anyone interested in learning about the Linux command line. With its thorough coverage and practical approach, this book is a valuable addition to any security library.",
        "totalPages": 480,
        "rating": 4.8,
        "category": "Linux",
        "tags": [
            "Linux",
            "Command Line"
        ],
        "publisher": "No Starch Press",
        "yearOfPublishing": 2012
    },
    {
        "bookId": 23,
        "bookName": "Android Hacker's Handbook",
        "author": "Joshua J. Drake",
        "image": "https://m.media-amazon.com/images/I/61xjT5j5lzL._AC_UF894,1000_QL80_.jpg",
        "review": "A detailed guide to the ins and outs of Android security. This book provides a comprehensive guide to Android security, covering a wide range of topics and techniques. Drake and his co-authors provide detailed explanations and practical examples to help readers understand and secure Android applications and devices. The book includes information on the latest tools and technologies used in Android security, as well as hands-on exercises to help readers apply the concepts. It's an essential resource for security professionals, developers, and anyone interested in learning about Android security. With its thorough coverage and practical approach, this book is a valuable addition to any security library.",
        "totalPages": 576,
        "rating": 4.7,
        "category": "Android Hacking",
        "tags": [
            "Security",
            "Android"
        ],
        "publisher": "Wiley",
        "yearOfPublishing": 2014
    },
    {
        "bookId": 24,
        "bookName": "The Tangled Web",
        "author": "Michal Zalewski",
        "image": "https://m.media-amazon.com/images/I/81LkHWI1iQL._AC_UF1000,1000_QL80_.jpg",
        "review": "A detailed exploration of the complex and poorly understood internals of web browsers. This book provides a comprehensive guide to web browser security, covering a wide range of topics and techniques. Zalewski provides detailed explanations and practical examples to help readers understand and secure web browsers. The book includes information on the latest tools and technologies used in web browser security, as well as hands-on exercises to help readers apply the concepts. It's an essential resource for security professionals, developers, and anyone interested in learning about web browser security. With its thorough coverage and practical approach, this book is a valuable addition to any security library.",
        "totalPages": 320,
        "rating": 4.6,
        "category": "Networking",
        "tags": [
            "Security",
            "Web"
        ],
        "publisher": "No Starch Press",
        "yearOfPublishing": 2011
    }
]
